import numpy as np


####################仅仅是一个示例###################################


# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[986.4572391,1.673607456,651.0717611],[0,1001.238398,535.8195077],[0.,0.,1.]])
        # 右相机内参
        self.cam_matrix_right = np.array([[998.5848065,7.37746018,667.3698587],[0,1006.305891,528.9731771],[0.,0.,1.]])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.154511565,0.325173292, 0.006934081,0.017466934, -0.340007548]])
        self.distortion_r = np.array([[-0.192887524,0.706728768, 0.004233541,0.021340116,-1.175486913]])

        # 旋转矩阵
        self.R = np.array([[0.999925137,-0.003616734,-0.01168927],
                           [0.003742452,0.999935202,0.010751105],
                           [0.011649629,-0.010794046,0.999873879]])

        # 平移矩阵
        self.T = np.array([-117.3364039,0.277054571,-3.7672413])

        # 焦距
        # self.focal_length = 859.367  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 119.9578  # 单位：mm， 为平移向量的第一个参数（取绝对值）




